{
  "auto_mapping": null,
  "base_model_name_or_path": "HuggingFaceTB/SmolLM2-135M",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 8,
  "lora_dropout": 0,
  "peft_type": "LORA",
  "r": 4,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj",
    "gate_proj",
    "up_proj",
    "down_proj"
  ],
  "task_type": "CAUSAL_LM"
}